app/controllers/users_controller.rb

UPDATE "users" SET "name" = 'New Name', "email" = 'new@example.com', "password_digest" = '$2a$04$VxhIHB4Gt/xZBKNA/h8x0OR.qHHXeRuCqRcLO7ZrEo10QiA5XE/WS', "remember_token" = 'PUfbLIicXyC88ky5xGCWsw', "updated_at" = '2012-07-06 14:35:05.694577' WHERE "users"."id" = 31
---
  def update
    if @user.update_attributes(params[:user])